Write a query that calculates the difference between the highest salaries found in the marketing and engineering departments. Output just the absolute difference in salaries.

https://platform.stratascratch.com/coding/10308-salaries-differences?code_type=1

In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv('data/dropbox_salary_department.csv')
df.head()

   id_x   department   id_y first_name last_name  salary  department_id
0     1  engineering  10307     Joseph   Solomon   19945              1
1     1  engineering  10311    Melissa    Holmes   33575              1
2     1  engineering  10316       Beth    Torres   34902              1
3     1  engineering  10324    William    Brewer   15947              1
4     1  engineering  10325      Brian    Nelson   27006              1

In [3]:
df_eng =df[df["department"]=='engineering']
df_eng = df_eng.groupby('department')['salary'].max().reset_index(name='eng_salary')

df_eng

    department  eng_salary
0  engineering       45787

In [4]:
df_mark =df[df["department"]=='marketing']
df_mark = df_mark.groupby('department')['salary'].max().reset_index(name='mkt_salary')

df_mark

  department  mkt_salary
0  marketing       48187

In [5]:
result = abs(pd.DataFrame(df_mark['mkt_salary'] - df_eng['eng_salary']))
result.columns = ['salary_difference']

result

   salary_difference
0               2400